# Install CLI tools
brew "git"
brew "gh"                          # GitHub CLI
brew "wget"
brew "curl"
brew "jq"                          # JSON processor
brew "yq"                          # YAML processor
brew "tree"
brew "htop"
brew "watch"
brew "tmux"
brew "openssl"
brew "gpg"                         # GNU Privacy Guard
brew "stow"

# Java/Kotlin Development
brew "openjdk", args: ["cask"]     # OpenJDK (Java)
brew "kotlin"                      # Kotlin compiler
brew "gradle"                      # Gradle build tool
brew "maven"                       # Maven build tool

# Node.js Development
brew "nvm"                         # Node Version Manager
brew "yarn"                        # Yarn package manager

# Databases
brew "postgresql"                  # PostgreSQL
brew "redis"                       # Redis

# Docker & Kubernetes
brew "docker", args: ["cask"]      # Docker Desktop alternative
brew "docker-compose"
brew "kubectl"                     # Kubernetes CLI
brew "kubectx"                     # Kubernetes context switcher
brew "helm"                        # Kubernetes package manager
brew "k9s"

# Dev Tools
brew "visual-studio-code", args: ["cask"]  # VS Code
brew "intellij-idea-ce", args: ["cask"]    # IntelliJ IDEA Community
brew "iterm2", args: ["cask"]              # iTerm2 (better terminal)
brew "postman", args: ["cask"]             # Postman API client
brew "dbeaver-community", args: ["cask"]   # Database GUI

# Fonts (Nerd Fonts required for Neovim icons)
brew "font-fira-code-nerd-font", args: ["cask"]
brew "font-hack-nerd-font", args: ["cask"]
brew "font-jetbrains-mono-nerd-font", args: ["cask"]

# Vim and related tools
brew "vim"                         # Vim editor
brew "neovim"                      # Neovim - modern Vim
brew "fzf"                         # Fuzzy finder (for Vim/Neovim)
brew "ripgrep"                     # Fast search (for Vim/Neovim)

# Python tools (for Vim linting)
brew "python"                      # Python (includes pip)
